IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/R5SS1_STC_R5SS1_STC.xml
	<register id="R5SS1_STC_STCSCSCR" acronym="R5SS1_STC_STCSCSCR" offset="0x1C" width="32" description="">
		<bitfield id="NU7" width="27" begin="31" end="5" resetval="0x0" description="Reserved bits" range="31 - 5" rwaccess="RO"/> 
		<bitfield id="FAULT_INS_B1" width="1" begin="4" end="4" resetval="0x0" description="Fault Insertion bit (RWP - Read, Priviledge Mode Write only)0   =  No fault insertion.1   =  Inserts fault in the logic unedr test which will make signature compare fail. This feature is used as diagnostic check of the STC IP." range="4" rwaccess="RW"/> 
		<bitfield id="SELF_CHECK_KEY_B4" width="4" begin="3" end="0" resetval="0x5" description="Signature compare logic self check key enable/disable (RWP - Read, Priviledge Mode Write only)1010   = Signature compare logic Self Check is enabledAll values other than 1010   = Signature compare logic Self Check is disabled" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS1_STC_STC_CADDR2" acronym="R5SS1_STC_STC_CADDR2" offset="0x20" width="32" description="">
		<bitfield id="ADDR" width="32" begin="31" end="0" resetval="0x0" description="Current ROM Address for CORE2This register reflects the current ROM address(for micro code load) accessed during selftest for CORE2 in of case segment0." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="R5SS1_STC_STC_CLKDIV" acronym="R5SS1_STC_STC_CLKDIV" offset="0x24" width="32" description="">
		<bitfield id="NU8" width="5" begin="31" end="27" resetval="0x0" description="Reserved bits" range="31 - 27" rwaccess="RO"/> 
		<bitfield id="CLKDIV0" width="3" begin="26" end="24" resetval="0x0" description="Clock division for Seg0 (RWP - Read, Priviledge Mode Write only)*NOT SUPPORTEDX   =  Division ratio is X+1 for Segment 0" range="26 - 24" rwaccess="RW"/> 
		<bitfield id="NU9" width="5" begin="23" end="19" resetval="0x0" description="Reserved bits" range="23 - 19" rwaccess="RO"/> 
		<bitfield id="CLKDIV1" width="3" begin="18" end="16" resetval="0x0" description="Clock division for Seg1 (RWP - Read, Priviledge Mode Write only)*NOT SUPPORTEDX   =  Division ratio is X+1 for Segment 1" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="NU10" width="5" begin="15" end="11" resetval="0x0" description="Reserved bits" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="CLKDIV2" width="3" begin="10" end="8" resetval="0x0" description="Clock division for Seg2 (RWP - Read, Priviledge Mode Write only)*NOT SUPPORTEDX   =  Division ratio is X+1 for Segment 2" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="NU11" width="5" begin="7" end="3" resetval="0x0" description="Reserved bits" range="7 - 3" rwaccess="RO"/> 
		<bitfield id="CLKDIV3" width="3" begin="2" end="0" resetval="0x0" description="Clock division for Seg3 (RWP - Read, Priviledge Mode Write only)*NOT SUPPORTEDX   =  Division ratio is X+1 for Segment 3" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS1_STC_STC_SEGPLR" acronym="R5SS1_STC_STC_SEGPLR" offset="0x28" width="32" description="">
		<bitfield id="NU12" width="30" begin="31" end="2" resetval="0x0" description="Reserved bits" range="31 - 2" rwaccess="RO"/> 
		<bitfield id="SEGID_PLOAD" width="2" begin="1" end="0" resetval="0x0" description="Segment number for which preload is to be started (RWP - Read, Priviledge Mode Write only)This specifies the segment for which the address of its First interval will be pre-loaded into the NSTC ROM address counter. The 1st address of each segment are defined in SEGx_START_ADDR register.The address of the 1st interval of the selected segment is loaded into the NSTC ROM address counter when the RS_CNT_B1 bits of STC_GCR0 are set to 1X00   =  Preload the address of the 1st interval of segment 0.01   =  Preload the address of the 1st interval of segment 1.10   =  Preload the address of the 1st interval of segment 2.11   =  Preload the address of the 1st interval of segment 3." range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS1_STC_SEG0_START_ADDR" acronym="R5SS1_STC_SEG0_START_ADDR" offset="0x2C" width="32" description="">
		<bitfield id="NU13" width="12" begin="31" end="20" resetval="0x0" description="Reserved bits" range="31 - 20" rwaccess="RO"/> 
		<bitfield id="SEG_START_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Segment 0 Start Address (RWP - Read, Priviledge Mode Write only)This register holds the ROM address for the start of first interval of the segment.When STC_GCR0.RS_CNT_B1 field is set to (1x) ?PRELOAD? option, this register is used to determine the ROM start address for the Segment selected in ST_SEGPLR register.Valid number of bits depends on RTL paramerter ADDR" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS1_STC_SEG1_START_ADDR" acronym="R5SS1_STC_SEG1_START_ADDR" offset="0x30" width="32" description="">
		<bitfield id="NU14" width="12" begin="31" end="20" resetval="0x0" description="Reserved bits" range="31 - 20" rwaccess="RO"/> 
		<bitfield id="SEG_START_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Segment 1 Start Address (RWP - Read, Priviledge Mode Write only)This register holds the ROM address for the start of first interval of the segment.When STC_GCR0.RS_CNT_B1 field is set to (1x) ?PRELOAD? option, this register is used to determine the ROM start address for the Segment selected in ST_SEGPLR register.Valid number of bits depends on RTL paramerter ADDR.This register is present only when RTL parameter NUM_SEG = 1." range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="R5SS1_STC_SEG2_START_ADDR" acronym="R5SS1_STC_SEG2_START_ADDR" offset="0x34" width="32" description="">
		<bitfield id="NU15" width="12" begin="31" end="20" resetval="0x0" description="Reserved bits" range="31 - 20" rwaccess="RO"/> 
		<bitfield id="SEG_START_ADDR" width="20" begin="19" end="0" resetval="0x0" description="Segment 2 Start Address (RWP - Read, Priviledge Mode Write only)This register holds the ROM address for the start of first interval of the segment.When STC_GCR0.RS_CNT_B1 field is set to (1x) ?PRELOAD? option, this register is used to determine the ROM start address for the Segment selected in ST_SEGPLR register.Valid number of bits depends on RTL paramerter ADDR.This register is present only when RTL parameter NUM_SEG = 2." range="19 - 0" rwaccess="RW"/>
	</register>
